earlephilhower/ESP8266FastROMFS/src/ESP8266FastROMFS.cpp
/*
  ESP8266FastROMFS
  Filesystem for onboard flash focused on speed

  Copyright (C) 2017  Earle F. Philhower, III

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

#ifdef ARDUINO
#include <Arduino.h>
#include <CRC32.h>
#else
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdint.h>
#include <time.h>
#endif

#include <ESP8266FastROMFS.h>

#ifndef DEBUGFASTROMFS
  #define DEBUGFASTROMFS 0
#endif

#ifdef ARDUINO
  #define DEBUG_FASTROMFS if (DEBUGFASTROMFS) Serial.printf
#else
  #define DEBUG_FASTROMFS if (DEBUGFASTROMFS) printf
#endif


#ifndef min
#define min(a,b) (((a)>(b))?(b):(a))
#endif
#ifndef max
#define max(a,b) (((a)>(b))?(a):(b))
#endif


bool FastROMFilesystem::exists(const char *name)
{
  if (!fsIsMounted) return false;

  if (FindFileEntryByName(name) >= 0) return true;
  return false;
}

bool FastROMFilesystem::rename(const char *old, const char *newName)
{
  if (!fsIsMounted) return false;
  int idx = FindFileEntryByName(old);
  int newIdx = FindFileEntryByName(newName);
  if ((idx >= 0) && (newIdx == -1)) {
    SetFileEntryName(idx, newName);
    return true;
  }
  return false;
}


void FastROMFilesystem::GetFileEntryName(int idx, char *dest)
{
  memcpy(dest, fs.fileEntry[idx].name, NAMELEN);
}

int FastROMFilesystem::GetFileEntryLen(int idx)
{
  return fs.fileEntry[idx].len;
}

int FastROMFilesystem::GetFileEntryFAT(int idx)
{
  return fs.fileEntry[idx].fat;
}

void FastROMFilesystem::SetFileEntryName(int idx, const char *src)
{
  strncpy(fs.fileEntry[idx].name, src, NAMELEN);
  fsIsDirty = true;
}

void FastROMFilesystem::SetFileEntryLen(int idx, int len)
{
  fs.fileEntry[idx].len = len;
  fsIsDirty = true;
}


void FastROMFilesystem::SetFileEntryFAT(int idx, int fat)
{
  fs.fileEntry[idx].fat = fat;
  fsIsDirty = true;
}

#ifndef ARDUINO
void FastROMFilesystem::DumpToFile(FILE *f)
{
  if (fsIsMounted) return; // Can't dump a mounted FS!
  for (size_t i=0; i<totalSectors; i++)
    fwrite(flash[i], SECTORSIZE, 1, f);
}

void FastROMFilesystem::LoadFromFile(FILE *f)
{
  if (fsIsMounted) return;
  fread(flash[0], SECTORSIZE, 1, f);
  memcpy(&fs, flash[0], SECTORSIZE);
  for (size_t i=1; i<fs.sectors; i++)
    fread(flash[i], SECTORSIZE, 1, f);
}
#endif


FastROMFSDir *FastROMFilesystem::opendir()
{
  if (!fsIsMounted) return NULL;
  struct FastROMFSDirent *de = (struct FastROMFSDirent *)malloc(sizeof(struct FastROMFSDirent));
  if (!de) return NULL; // OOM
  de->off = -1;
  return (void*)de;
}

struct FastROMFSDirent *FastROMFilesystem::readdir(FastROMFSDir *dir)
{
  if (!fsIsMounted) return NULL;
  struct FastROMFSDirent *de = reinterpret_cast<struct FastROMFSDirent *>(dir);
  de->off++;
  while (de->off < FILEENTRIES) {
    char name[NAMELEN];
    GetFileEntryName(de->off, name);
    if (name[0]) {
      strncpy(de->name, name, sizeof(name));
      de->name[sizeof(de->name) - 1] = 0;
      de->len = GetFileEntryLen(de->off);
      return de;
    }
    de->off++;
  }
  return NULL;
}

int FastROMFilesystem::closedir(FastROMFSDir *dir)
{
  if (!fsIsMounted) return false;
  if (!dir) return -1;
  free(dir);
  return 0;
}

#ifdef ARDUINO
void crc32(const void *data, size_t n_bytes, uint32_t* crc)
{
  *crc = 0;
  CRC32 crc32;
  crc32.update(data, n_bytes);
  *crc = crc32.finalize();
}
#else
uint32_t crc32_for_byte(uint32_t r) {
  for (int j = 0; j < 8; ++j) {
    r = (r & 1 ? 0 : (uint32_t)0xEDB88320L) ^ r >> 1;
  }
  return r ^ (uint32_t)0xFF000000L;
}

void crc32(const void *data, size_t n_bytes, uint32_t* crc) {
  static uint32_t table[0x100];
  if (!*table) {
    for (size_t i = 0; i < 0x100; ++i) {
      table[i] = crc32_for_byte(i);
    }
  }
  for (size_t i = 0; i < n_bytes; ++i) {
    *crc = table[(uint8_t) * crc ^ ((uint8_t*)data)[i]] ^ *crc >> 8;
  }
}
#endif


#ifdef ARDUINO
extern "C" uint32_t _SPIFFS_start;
extern "C" uint32_t _SPIFFS_end;
#endif

FastROMFilesystem::FastROMFilesystem()
{
#ifdef ARDUINO
  baseAddr = ((uint32_t) (&_SPIFFS_start) - 0x40200000); // Magic constants taken from SPIFF_API.cpp
  baseSector = baseAddr / SECTORSIZE;
  totalSectors = ((uint32_t)&_SPIFFS_end - (uint32_t)&_SPIFFS_start) / SECTORSIZE;

  DEBUG_FASTROMFS("baseAddr=%08x, baseSector=%ld, totalSectors=%ld\n", baseAddr, baseSector, totalSectors);

  lastFlashSector = -1; // Invalidate the 1-word cache
#else
  for (int i = 0; i < FATENTRIES; i++) flashErased[i] = false;
  totalSectors = FATENTRIES;
#endif
  fsIsDirty = false;
  fsIsMounted = false;
}

FastROMFilesystem::~FastROMFilesystem()
{
  if (fsIsMounted) umount();
}


void FastROMFilesystem::DumpFS()
{
  DEBUG_FASTROMFS("fs.epoch = %ld; fs.sectors = %ld\n", fs.epoch, fs.sectors);
  
  DEBUG_FASTROMFS("%-32s - %-5s - %-5s\n", "name", "len", "fat");
  for (int i = 0; i < FILEENTRIES; i++) {
    if (fs.fileEntry[i].name[0]) {
      char nm[NAMELEN+1];
      memcpy(nm, fs.fileEntry[i].name, NAMELEN);
      nm[NAMELEN] = 0;
      DEBUG_FASTROMFS("%32s - %5d - %5d\n", nm, fs.fileEntry[i].len, fs.fileEntry[i].fat);
    }
  }
  for (int i = 0; i < fs.sectors; i++) {
    DEBUG_FASTROMFS("%s%5d:%-5d ", 0 == (i % 8) ? "\n" : "", i, GetFAT(i));
  }
  DEBUG_FASTROMFS("\n\n");
}

void FastROMFilesystem::DumpSector(int sector)
{
  DEBUG_FASTROMFS("Sector: %d", sector);
#ifdef ARDUINO
  uint8_t *buff = new uint8_t[SECTORSIZE];
  ReadSector(sector, buff);
  for (int i = 0; i < SECTORSIZE; i++)
    DEBUG_FASTROMFS("%s%02x ", (i % 32) == 0 ? "\n" : "", buff[i]);
  delete[] buff;
#else
  for (int i = 0; i < SECTORSIZE; i++)
    DEBUG_FASTROMFS("%s%02x ", (i % 32) == 0 ? "\n" : "", flash[sector][i]);
#endif
  DEBUG_FASTROMFS("\n");
}

int FastROMFilesystem::available()
{
  if (!fsIsMounted) return false;
  int avail = 0;
  for (int i = 0; i < fs.sectors; i++) {
    if (GetFAT(i) == 0) avail += SECTORSIZE;
  }
  return avail;
}

int FastROMFilesystem::fsize(const char *name)
{
  if (!fsIsMounted) return false;
  int idx = FindFileEntryByName(name);
  if (idx < 0) return -1;
  return GetFileEntryLen(idx);
}

bool FastROMFilesystem::ValidateFAT()
{
  if (fs.magic != FSMAGIC) return false;
  uint32_t savedCRC = fs.crc;
  uint32_t calcCRC = 0;
  fs.crc = 0;
  crc32((void*)&fs, sizeof(fs), &calcCRC);
  if (savedCRC != calcCRC) return false; // Something baaaad here!
  return true;
}

int FastROMFilesystem::FindOldestFAT()
{
  int oldIdx = 0;
  int64_t oldEpoch = 1LL << 62;
  for (int i = 0; i < FATCOPIES; i++) {
    uint64_t space[2]; // hold magic and epoch only
    ReadPartialSector(i, 0, space, sizeof(space));
    if (space[0] != FSMAGIC) {
      // This one is bad, so let's overwrite it!
      return i;
    }
    if ((int64_t)space[1] < oldEpoch) {
      oldIdx = i;
      oldEpoch = (int64_t)space[1];
    }
  }
  return oldIdx;
}

// Scan the FS and return index of latest epoch
int FastROMFilesystem::FindNewestFAT()
{
  int newIdx = -1;
  int64_t newEpoch = 0;
  for (int i = 0; i < FATCOPIES; i++) {
    uint64_t space[2]; // hold magic and epoch
    ReadPartialSector(i, 0, space, sizeof(space));
    if (space[0] != FSMAGIC) continue; // Ignore invalid ones
    if ((int64_t)space[1] > newEpoch) {
      newIdx = i;
      newEpoch = (int64_t)space[1];
    }
  }
  return newIdx;
}

