earlephilhower/ESP8266FastROMFS/src/ESP8266FastROMFS.cpp
int FastROMFilesystem::FindFileEntryByName(const char *name)
{
  if (!name) return -1;

  for (int i = 0; i < FILEENTRIES; i++) {
    if (!strncmp(fs.fileEntry[i].name, name, sizeof(fs.fileEntry[i].name))) return i;
  }
  return -1;
}

int FastROMFilesystem::FindFreeFileEntry()
{
  for (int i = 0; i < FILEENTRIES; i++) {
    if (fs.fileEntry[i].name[0] == 0) return i;
  }
  return -1; // No space
}

int FastROMFilesystem::CreateNewFileEntry(const char *name)
{
  int idx = FindFreeFileEntry();
  int sec = FindFreeSector();
  if ((idx < 0) || (sec < 0)) return -1;
  strncpy(fs.fileEntry[idx].name, name, sizeof(fs.fileEntry[idx].name));
  fs.fileEntry[idx].fat = sec;
  fs.fileEntry[idx].len = 0;
  fsIsDirty = true;
  SetFAT(sec, FATEOF);
  if (!FlushFAT()) return -1;
  return idx;
}

bool FastROMFilesystem::unlink(const char *name)
{
  if (!fsIsMounted) return false;
  DEBUG_FASTROMFS("unlink('%s')\n", name);
  int idx = FindFileEntryByName(name);
  if (idx < 0) return false;
  int sec = fs.fileEntry[idx].fat;
  while (GetFAT(sec) != FATEOF) {
    int nextSec = GetFAT(sec);
    SetFAT(sec, 0);
    sec = nextSec;
  }
  SetFAT(sec, 0);
  fs.fileEntry[idx].name[0] = 0;
  fs.fileEntry[idx].len = 0;
  fs.fileEntry[idx].fat = 0;
  return FlushFAT();
}

int FastROMFilesystem::GetFAT(int idx)
{
  if ((idx < 0) || (idx >= fs.sectors)) return -1;

  int bo = (idx / 2) * 3;
  int ret;
  if (idx & 1) {
    ret = fs.fat[bo + 1] & 0x0f;
    ret <<= 8;
    ret |= fs.fat[bo + 2];
  } else {
    ret = fs.fat[bo + 1] & 0xf0;
    ret <<= 4;
    ret |= fs.fat[bo];
  }
  return ret;
}

void FastROMFilesystem::SetFAT(int idx, int val)
{
  if ((idx < 0) || (idx >= fs.sectors)) return;

  int bo = (idx / 2) * 3;
  if (idx & 1) {
    fs.fat[bo + 1] &= ~0x0f;
    fs.fat[bo + 1] |= (val >> 8) & 0x0f;
    fs.fat[bo + 2] = val & 0xff;
  } else {
    fs.fat[bo + 1] &= ~0xf0;
    fs.fat[bo + 1] |= (val >> 4) & 0xf0;
    fs.fat[bo] = val & 0xff;
  }

  fsIsDirty = true;
}

int FastROMFilesystem::FindFreeSector()
{
  int a = rand() % fs.sectors;
  for (int i = 0; (i < fs.sectors) && (GetFAT(a) != 0);  i++, a = (a + 1) % fs.sectors) {
    /*empty*/
  }
  if (GetFAT(a) != 0) return -1;
  return a;
}


bool FastROMFilesystem::EraseSector(int sector)
{
  if ((sector < 0) || (sector >= fs.sectors)) return false;

  DEBUG_FASTROMFS("EraseSector(%d)\n", sector);
#ifdef ARDUINO
  // If we're messing with this sector, invalidate any cached data corresponding to it
  if (sector == lastFlashSector) lastFlashSector = -1;

  return ESP.flashEraseSector(baseSector + sector);
#else
  memset(flash[sector], 0, SECTORSIZE);
  flashErased[sector] = true;
  return true;
#endif
}

bool FastROMFilesystem::WriteSector(int sector, const void *data)
{
  DEBUG_FASTROMFS("WriteSector(%d, data)\n", sector);

  if ((sector < 0) || (sector >= fs.sectors) || !data) return false;
  if ((const uintptr_t)data % 4) return false; // Need to have 32-bit aligned inputs!

#ifdef ARDUINO
  // If we're messing with this sector, invalidate any cached data corresponding to it
  if (sector == lastFlashSector) lastFlashSector = -1;

  return ESP.flashWrite(baseAddr + sector * FLASH_SECTOR_SIZE, (uint32_t*)data, FLASH_SECTOR_SIZE);
#else
  if (!flashErased[sector]) {
    DEBUG_FASTROMFS("!!!ERROR, sector not erased!!!\n");
    return false;
  }
  memcpy(flash[sector], data, SECTORSIZE);
  flashErased[sector] = false;
  return true;
#endif
}


bool FastROMFilesystem::ReadSector(int sector, void *data)
{
  if ((sector < 0) || (sector >= fs.sectors) || !data) return false;
  if ((const uintptr_t)data % 4) return false; // Need to have 32-bit aligned inputs!

#ifdef ARDUINO
  return ESP.flashRead(baseAddr + sector * FLASH_SECTOR_SIZE, (uint32_t*)data, FLASH_SECTOR_SIZE);
#else
  memcpy(data, flash[sector], SECTORSIZE);
  return true;
#endif
}

bool FastROMFilesystem::ReadPartialSector(int sector, int offset, void *data, int len)
{
  if ((sector < 0) || (sector >= fs.sectors) || !data || (len < 0) || (offset < 0) || (offset + len > SECTORSIZE)) return false;

  // Easy case, everything is aligned and we can just do it...
  if ( ((offset % 4) == 0) && ((len % 4) == 0) && (((const uintptr_t)data % 4) == 0) ) {
#ifdef ARDUINO
    ESP.flashRead(baseAddr + sector * FLASH_SECTOR_SIZE + offset, (uint32_t*)data, len);
#else
    memcpy(data, &flash[sector][offset], len);
#endif
    return true;
  }

  memset(data, 0, len); // Clear buffer just for debugging sanity

  // We're gonna get wordy here for sanity's sake.  This align and shifting is a brain twister.
  uint8_t *destStart = reinterpret_cast<uint8_t*>(data);
  uint8_t *destEnd = destStart + len;
  uint8_t *destStartAligned = (uint8_t*) ((uintptr_t)(destStart + 3) & (uintptr_t) ~3);
  uint8_t *destEndAligned = (uint8_t*) ((uintptr_t)(destEnd) & (uintptr_t) ~3);
  int destLen = destEnd - destStart;
  int destLenAligned = destEndAligned - destStartAligned;
  int srcStart = offset;
  int srcEnd = srcStart + len;
  int srcLen = len;
  int srcStartAligned = (srcStart) & ~3;
  int srcEndAligned = (srcEnd + 3) & ~3;
  int srcLenAligned = srcEndAligned - srcStartAligned;
  int shiftLeftBytes = 0;
  int bytesToShift = 0;
  if (destLenAligned > 0) {
    // Read the flash aligned into the ram aligned
#ifdef ARDUINO
    ESP.flashRead(baseAddr + sector * FLASH_SECTOR_SIZE + srcStartAligned, (uint32_t*)destStartAligned, destLenAligned);
#else
    memcpy(destStartAligned, &flash[sector][srcStartAligned], destLenAligned);
#endif
    // Move it to the beginning of the buffer
    shiftLeftBytes = (destStartAligned - destStart) /* account for ram shift */ + (srcStart - srcStartAligned); /* flash shift */
    bytesToShift = destLenAligned - (srcStart - srcStartAligned); // the alignment flash bytes are thrown away, all else kept
    memmove(destStart, destStart + shiftLeftBytes, bytesToShift); // memmove because these overlap
    // Adjust the pointers to indicate what we've completed so far, again for sanity's sake.
    destStart += bytesToShift; // We wrote this many bytes
    destLen -= bytesToShift;
    memset(destStart, 0, destLen); // Clear for easier debug
    srcStart += bytesToShift;
    srcStartAligned = (srcStart) & ~3;
    srcLen -= bytesToShift;
    srcLenAligned = srcEndAligned - srcStartAligned;
  }
  // Now let's do the same thing to a stack buffer and memcpy to the final bit of ram
  uint8_t buff[64 + 8]; // bounce buffer, need to account for shift of RAM and flash
  uint8_t *alignBuff = (uint8_t*)((uintptr_t)(buff + 3) & (uintptr_t) ~3); // 32bit aligned pointer into that buffer
  // Read remainder of flash to the alignment bounce buffer.
#ifdef ARDUINO
  // Check if we have cached this data (only valid if it fits in 1 32-bit word)
  if ( (lastFlashSector == sector) && (lastFlashSectorOffset == srcStartAligned) && (srcLenAligned == 4) ) {
      *(uint32_t*)alignBuff = lastFlashSectorData;
  } else {
    // Nope, read it out
    ESP.flashRead(baseAddr + sector * FLASH_SECTOR_SIZE + srcStartAligned, (uint32_t*)alignBuff, srcLenAligned);
  
    // Store the read out data for potential use by subsequent ReadPartials if it was a single 32-bit read
    if (srcLenAligned == 4) {
      lastFlashSector = sector;
      lastFlashSectorOffset = srcStartAligned;
      lastFlashSectorData = *(uint32_t*)alignBuff;
    }
  }
#else
  memcpy(alignBuff, &flash[sector][srcStartAligned], srcLenAligned);
#endif
  // Move it to destination buffer
  memcpy(destStart, alignBuff + (srcStart - srcStartAligned), srcLen);
  // Eh voila...easy peasy, lemon squeezy
#ifndef ARDUINO
  void *simpledata = (void*)malloc(len);
  memcpy(simpledata, &flash[sector][offset], len);
  if (memcmp(simpledata, data, len))
    DEBUG_FASTROMFS("ERROR!  Misaligned read data doesn't match correct\n");
  free(simpledata);
#endif
  return true;
}

bool FastROMFilesystem::mkfs()
{
  if (fsIsMounted) return false;
  memset(&fs, 0, sizeof(fs));
  fs.magic = FSMAGIC;
  fs.epoch = 1;
  fs.sectors = totalSectors;
  for (int i = 0; i < FATCOPIES; i++) {
    SetFAT(i, FATEOF);
  }
  for (int i = 0; i < FATCOPIES; i++) {
    if (!EraseSector(i)) return false;
    if (!WriteSector(i, &fs)) return false;
  }
  // Fake Flush() out to ensure we're written...
  fsIsMounted = true;
  fsIsDirty = true;
  FlushFAT();
  fsIsMounted = false;
  fsIsDirty = false;
  return true;
}

bool FastROMFilesystem::mount()
{
  DEBUG_FASTROMFS("mount()\n");
  if (fsIsMounted) return false;
  fs.sectors = totalSectors; // We can potentially read up to this many sectors...
  int idx = FindNewestFAT();
  if (idx >= 0) {
    DEBUG_FASTROMFS("FAT is located at sector %d\n", idx);
    if (!ReadSector(idx, &fs)) return false;
    if (!ValidateFAT()) return false;
    fsIsDirty = false;
    fsIsMounted = true;
    return true;
  } else {
    DEBUG_FASTROMFS("ERROR!!! FAT NOT FOUND!\n");
    return false;
  }
}

