earlephilhower/ESP8266FastROMFS/src/ESP8266FastROMFS.cpp
bool FastROMFilesystem::umount()
{
  if (!fsIsMounted) return false;
  DEBUG_FASTROMFS("umount()\n");
  if (!FlushFAT()) return false;
  fsIsMounted = false;
  return true;
}

bool FastROMFilesystem::FlushFAT()
{
  DEBUG_FASTROMFS("FlushFAT(), ismounted=%d, isdirty=%d\n", !!fsIsMounted, !!fsIsDirty);
  if (!fsIsMounted || !fsIsDirty) return true; // Nothing to do here...

  fs.epoch++;
  fs.crc = 0;
  uint32_t calcCRC = 0;
  crc32((void*)&fs, sizeof(fs), &calcCRC);
  fs.crc = calcCRC;
  int idx = FindOldestFAT();
  if (idx >= 0) {
    if (!EraseSector(idx)) return false;
    bool ret = WriteSector(idx, &fs);
    if (ret) fsIsDirty = false;
    return ret;
  }
  return false;
}

FastROMFile *FastROMFilesystem::open(const char *name, const char *mode)
{
  if (!fsIsMounted) return NULL;
  if (!name || !mode) return NULL;

  DEBUG_FASTROMFS("open('%s', '%s')\n", name, mode);
  if (!strcmp(mode, "r") || !strcmp(mode, "rb")) { //  Open text file for reading.  The stream is positioned at the beginning of the file.
    int fidx = FindFileEntryByName(name);
    if (fidx < 0) return NULL;
    return new FastROMFile(this, fidx, 0, 0,  true, false, false, false);
  } else if (!strcmp(mode, "r+") || !strcmp(mode, "r+b")) { // Open for reading and writing.  The stream is positioned at the beginning of the file.
    int fidx = FindFileEntryByName(name);
    if (fidx < 0) return NULL;
    return new FastROMFile(this, fidx, 0, 0,  true, true, false, false);
  } else if (!strcmp(mode, "w") || !strcmp(mode, "wb")) { // Truncate file to zero length or create text file for writing.  The stream is positioned at the beginning of the file.
    unlink(name); // ignore failure, may not exist
    int fidx = CreateNewFileEntry(name);
    return new FastROMFile(this, fidx, 0, 0, false, true, false, true);
  } else if (!strcmp(mode, "w+") || !strcmp(mode, "w+b")) { // Open for reading and writing.  The file is created if it does not exist, otherwise it is truncated.  The stream is positioned at the beginning of the file.
    unlink(name); // ignore failure, may not exist
    int fidx = CreateNewFileEntry(name);
    return new FastROMFile(this, fidx, 0, 0, true, true, false, true);
  } else if (!strcmp(mode, "a") || !strcmp(mode, "ab")) { // Open for appending (writing at end of file).  The file is created if it does not exist.  The stream is positioned at the end of the file.
    int fidx = FindFileEntryByName(name);
    int sfidx = fidx;
    if (fidx < 0) fidx = CreateNewFileEntry(name);
    return new FastROMFile(this, fidx, 0, fs.fileEntry[fidx].len, false, true, true, sfidx < 0 ? true : false);
  } else if (!strcmp(mode, "a+") || !strcmp(mode, "a+b")) { // Open for reading and appending (writing at end of file).  The file is created if it does not exist.  The initial file position for reading is at the beginning of the file, but output is always appended to the end of the file.
    int fidx = FindFileEntryByName(name);
    int sfidx = fidx;
    if (fidx < 0) fidx = CreateNewFileEntry(name);
    return new FastROMFile(this, fidx, 0, fs.fileEntry[fidx].len, true, true, true, sfidx < 0 ? true : false);
  }
  return NULL;
}

FastROMFile::~FastROMFile()
{
  free(data);
}

FastROMFile::FastROMFile(FastROMFilesystem *fs, int fileIdx, int readOffset, int writeOffset, bool read, bool write, bool append, bool eraseFirstSector)
{
  this->fs = fs;
  this->modeRead = read;
  this->modeWrite = write;
  this->modeAppend = append;
  this->fileIdx = fileIdx;

  if (modeWrite || modeAppend) {
    data = (uint8_t*)malloc(SECTORSIZE);
    if (eraseFirstSector) {
      memset(data, 0, SECTORSIZE);
      fs->EraseSector(fs->GetFileEntryFAT(fileIdx));
      fs->WriteSector(fs->GetFileEntryFAT(fileIdx), data);
    }
  } else {
    data = NULL;
  }
  dataDirty = false;

  readPos = readOffset;
  writePos = writeOffset;

  curWriteSector = -1;
  curWriteSectorOffset = -SECTORSIZE;
  curReadSector = -1;
  curReadSectorOffset = -SECTORSIZE;

}

int FastROMFile::fgetc()
{
  uint8_t c;
  if (0 == read(&c, 1)) return -1;
  return c;
}

int FastROMFile::fputc(int c)
{
  uint8_t cc = (uint8_t)c;
  if (0 == write(&cc, 1)) return -1;
  return 0;
}

int FastROMFile::size()
{
  return fs->GetFileEntryLen(fileIdx);
}

void FastROMFile::name(char *buff, int len)
{
  char name[NAMELEN + 1];
  fs->GetFileEntryName(fileIdx, name);
  name[NAMELEN] = 0;
  strncpy(buff, name, len);
  buff[len - 1] = 0;
}


int FastROMFile::tell()
{
  if (modeRead) return readPos;
  return writePos;
}

int FastROMFile::eof()
{
  if (modeRead) return (readPos == fs->GetFileEntryLen(fileIdx)) ? true : false;
  return false;  //TODO...what does eof() on a writable only file mean?
}

size_t FastROMFile::write(const uint8_t *out, size_t size)
{
  if (!size || !out || !modeWrite) return 0;
  size_t writtenBytes = 0;

  // Make sure we're writing somewhere within the current sector
  if (! ( (curWriteSectorOffset <= writePos) && ((curWriteSectorOffset + SECTORSIZE) > writePos) ) ) {
    if (dataDirty) {
      if (!fs->EraseSector(curWriteSector)) return 0;
      if (!fs->WriteSector(curWriteSector, data)) return 0;
    }
    // Traverse the FAT table, optionally extending the file
    curWriteSector = fs->GetFileEntryFAT(fileIdx);
    curWriteSectorOffset = 0;
    int lastSector = -1; // Used to update file links
    while (! ( (curWriteSectorOffset <= writePos) && ((curWriteSectorOffset + SECTORSIZE) > writePos) ) ) {
      lastSector = curWriteSector;
      if (fs->GetFAT(curWriteSector) == FATEOF) { // Need to extend
        int newSector = fs->FindFreeSector();
        if (newSector < 0) return 0; // Out of space
        fs->SetFAT(curWriteSector, newSector);
        fs->SetFAT(newSector, FATEOF);
        curWriteSector = newSector;
        memset(data, 0, SECTORSIZE);
        if (!fs->EraseSector(curWriteSector)) return 0;
        if (!fs->WriteSector(curWriteSector, data)) return 0;
      } else {
        curWriteSector = fs->GetFAT(curWriteSector);
      }
      curWriteSectorOffset += SECTORSIZE;
    }
    if (fs->GetFileEntryLen(fileIdx) > curWriteSectorOffset) { // Read in old data
      if (!fs->ReadSector(curWriteSector, data)) return 0;
      // Try and allocate a new sector to write the updated data, update the FAT links
      int newSector = fs->FindFreeSector();
      if (newSector > 0) {
        if (lastSector==-1) {
          int nextSector = fs->GetFAT(fs->GetFileEntryFAT(fileIdx));
          fs->SetFileEntryFAT(fileIdx, newSector);
          fs->SetFAT(newSector, nextSector);
        } else {
          int nextSector = fs->GetFAT(curWriteSector);
          fs->SetFAT(lastSector, newSector);
          fs->SetFAT(newSector, nextSector);
        }
        dataDirty = true; // We definitely need to rewrite, no matter what happens later on
        fs->SetFAT(curWriteSector, 0); // Free original block
        curWriteSector = newSector;
      } else {
        // No space, just leave it where it is...
      }
    } else { // New sector...
      memset(data, 0, SECTORSIZE);
    }
    fs->SetFileEntryLen(fileIdx, max(fs->GetFileEntryLen(fileIdx), curWriteSectorOffset));
  }

  // We're in the correct sector.  Start writing and extending/overwriting
  while (size) {
    int amountWritableInThisSector = min(size, SECTORSIZE - (writePos % SECTORSIZE));
    if (writePos >= curWriteSectorOffset + SECTORSIZE) amountWritableInThisSector = 0;
    if (amountWritableInThisSector == 0) {
      if (dataDirty) { // need to flush this sector
        if (!fs->EraseSector(curWriteSector)) return 0;
        if (!fs->WriteSector(curWriteSector, data)) return 0;
        dataDirty = false;
      }
      if (fs->GetFAT(curWriteSector) != FATEOF) { // Update - read in old data
        curWriteSector = fs->GetFAT(curWriteSector);
        if (!fs->ReadSector(curWriteSector, data)) return 0;
      } else { // Extend the file
        int newSector = fs->FindFreeSector();
        if (newSector < 0) return 0; // Out of space
        fs->SetFAT(curWriteSector, newSector);
        curWriteSector = newSector;
        fs->SetFAT(newSector, FATEOF);
      }
      curWriteSectorOffset = writePos;
      amountWritableInThisSector = min(size, SECTORSIZE);
    }
    // By now either have writable space in old or new sector
    memcpy(&data[writePos % SECTORSIZE], out, amountWritableInThisSector);
    dataDirty = true; // We need to flush this on close() or leaving the sector
    writePos += amountWritableInThisSector; // We wrote this little bit
    writtenBytes += amountWritableInThisSector;
    if (!modeAppend) readPos = writePos;
    fs->SetFileEntryLen(fileIdx, max(fs->GetFileEntryLen(fileIdx), writePos)); // Potentially we just extended the file
    // Reduce bytes available to write, increment data pointer
    size -= amountWritableInThisSector;
    out = reinterpret_cast<const uint8_t*>(out) + amountWritableInThisSector;
  }

