earlephilhower/ESP8266FastROMFS/src/ESP8266FastROMFS.cpp
  return writtenBytes;
}

int FastROMFile::close()
{
  DEBUG_FASTROMFS("close()\n");
  if (!modeWrite && !modeAppend) return 0;
  if (!dataDirty) return 0;
  if (!fs->EraseSector(curWriteSector)) return -1;
  int ret = fs->WriteSector(curWriteSector, data) ? 0 : -1;
  delete this;
  return ret;
}


int FastROMFile::sync()
{
  if (!modeWrite && !modeAppend) return 0;
  if (!dataDirty) return 0;
  if (!fs->EraseSector(curWriteSector)) return -1;
  if (!fs->WriteSector(curWriteSector, data)) return -1;
  dataDirty = false;
  return fs->FlushFAT();
}

int FastROMFile::read(void *in, int size)
{
  if (!modeRead || !in || !size) return 0;

  int readableBytesInFile = fs->GetFileEntryLen(fileIdx) - readPos;
  size = min(readableBytesInFile, size); // We can only read to the end of file...
  if (size <= 0) return 0;

  int readBytes = 0;

  // Make sure we're reading from somewhere in the current sector
  if (! ( (curReadSectorOffset <= readPos) && ((curReadSectorOffset + SECTORSIZE) > readPos) ) ) {
    // Traverse the FAT table, optionally extending the file
    curReadSector = fs->GetFileEntryFAT(fileIdx);
    curReadSectorOffset = 0;
    while (! ( (curReadSectorOffset <= readPos) && ((curReadSectorOffset + SECTORSIZE) > readPos) ) ) {
      if (fs->GetFAT(curReadSector) == FATEOF) { // Oops, reading past EOF!
        return 0; // EOF!...this path shouldn't happen...
      } else {
        curReadSector = fs->GetFAT(curReadSector);
      }
      curReadSectorOffset += SECTORSIZE;
    }
  }

  while (size) {
    int offsetIntoData = readPos % SECTORSIZE; //= pointer into data[]
    int amountReadableInThisSector = min(size, SECTORSIZE - (readPos % SECTORSIZE));
    if (readPos > curReadSectorOffset + SECTORSIZE) amountReadableInThisSector = 0;
    if (amountReadableInThisSector == 0) {
      if (curReadSector == FATEOF) { // end
        return readBytes; // Hit EOF...again, should not happen ever
      } else {
        curReadSector = fs->GetFAT(curReadSector);
      }
      curReadSectorOffset += SECTORSIZE;
      amountReadableInThisSector = min(size, SECTORSIZE);
    }
    if (curReadSector == curWriteSector) { // R-A-W, so forward the data
      memcpy(in, &data[offsetIntoData], amountReadableInThisSector);
    } else {
      if (!fs->ReadPartialSector(curReadSector, offsetIntoData, in, amountReadableInThisSector)) return 0;
    }
    readPos += amountReadableInThisSector;
    if (!modeAppend) writePos = readPos;
    size -= amountReadableInThisSector;
    readBytes += amountReadableInThisSector;
    in = reinterpret_cast<char*>(in) + amountReadableInThisSector;
  }
  return readBytes;
}

bool FastROMFile::seek(int off, int whence)
{
  int absolutePos; // = offset we want to seek to from start of file
  switch (whence) {
    case SEEK_SET: absolutePos = off; break;
    case SEEK_CUR: absolutePos = readPos + off; break;
    case SEEK_END: absolutePos = fs->GetFileEntryLen(fileIdx) + off; break;
    default: return false;
  }
  if (absolutePos < 0) return -1; // Can't seek before beginning of file
  if (modeAppend) {
    if (!modeRead) return -1; // seeks not allowed on append
  } else {
    readPos = absolutePos; // a+ => read can move, write always appends
    writePos = absolutePos; // a+ => read can move, write always appends
  }
  return true;
}
